%initial params

%弹体参数配置
M=5;%质量kg
Izz=0.4;%三轴转动惯量
Iyy=0.4;
Ixx=0.04;

S=0.04;%参考面积 m^2
AR=1.5;%展弦比
L_ref=0.7;%弹长m
L_duck=0.25;%机翼到中心距离m
b=0.2;%翼长m

P=50;%N  推力
V0=30;%导弹初始速度

zeta0=0;%初始弹道倾角
psi0=3.14/7;%初始弹道偏角

x0=0;%导弹初始位置   坐标系：投弹点下方地面为原点，向目标为X,向上为Y
y0=30;
z0=0;


wx0=0;%导弹初始XYZ轴方向上的旋转速率
wy0=0;
wz0=0;

         %初始姿态角
pitch0=0;%俯仰
yaw0=3.14/7;%偏航
roll0=0;%滚转

%环境参数配置
g=9.8;%重力加速度 m/s^2
%%%!!!气动系数等参数请在slx文件 受力subsystem中空气动力、pitch、yaw、roll三个函数中进行修改!!!

%目标参数配置         
Xtar=100;   %目标初始位置
Ytar=0;
Ztar=0;

%相机参数配置
f=18;%焦距 mm
size=0.5*254;%成像底的大小mm  0.5英寸*254mm/英寸
u_max=1920;%横向像素点数量
v_max=1080;%纵向像素点数量
